3.3 Path Expressions

==================
3.3 Path Expr - leading lone slash
==================

/

---

(module (main_module (path_expr)))

==================
3.3 Path Expr - lone slash or double with rel path,
==================

 //child::div1

---

(module 
  (main_module 
    (path_expr 
      (axis_step 
        (forward_axis) 
        (name_test (EQName (identifier)))))))

==================
3.3 Path Expr just a relative path
==================

child::div1

---

(module 
  (main_module 
    (path_expr 
      (axis_step 
        (forward_axis) 
        (name_test (EQName (identifier)))))))

==================
3.3.1 Path operator (/) wildcard
==================

$node/*

---

(module 
(main_module 
(path_expr (var (EQName (identifier))) 
(axis_step (name_test (wildcard))))))

==================
3.3.1 Path operator (/) kind test
==================

$node/text()

---

(module (main_module (path_expr (var (EQName (identifier))) (axis_step (kind_test (text_test))))))
 

==================
3.3.1 Path - Relative Path Expressions
==================

child::div1/child::para

---

(module (main_module (path_expr (axis_step (forward_axis) (name_test (EQName (identifier)))) (axis_step (forward_axis) (name_test (EQName (identifier)))))))

==================
3.3.2 Path  Node Tests with wildcard
==================

child::element(*, po:address)

---

(module (main_module 
          (path_expr 
            (axis_step (forward_axis) (kind_test (element_test (element_test_params (wildcard) (EQName (identifier) (identifier)))))))))

==================
3.3.3 Path  Predicates within Steps
==================

 child::chapter[2]

---

 (module (main_module (path_expr (axis_step (forward_axis) (name_test (EQName (identifier))) (predicate (integer_literal))))))

==================
3.3.4 Path Unabbreviated Syntax
==================

child::para

---

 (module (main_module (path_expr (axis_step (forward_axis) (name_test (EQName (identifier)))))))


==================
3.3.4 Path Unabbreviated Syntax with steps and predicate
==================

child::para[fn:position() = 1]

---

(module 
  (main_module 
    (path_expr 
      (axis_step 
        (forward_axis) 
        (name_test (EQName (identifier))) 
        (predicate 
          (comparison_expr 
            (function_call (EQName (identifier) (identifier)) (arguments)) (integer_literal)))))))

==================
3.3.5 Path: Abbreviated Syntax  with EQName (identifier)
==================

section/para

---

(module 
  (main_module 
    (path_expr 
      (axis_step 
        (name_test 
          (EQName (identifier)))) 
      (axis_step 
        (name_test 
          (EQName (identifier)))))))

==================
3.3.5 Path: Abbreviated Syntax with attribute
==================

section/@id

---

(module 
  (main_module 
    (path_expr 
      (axis_step 
        (name_test (EQName (identifier)))) 
      (axis_step 
        (abbrev_foward)
        (name_test (EQName (identifier)))))))



==================
3.3.5 Path: Abbreviated Syntax with attribute wildcard
==================

@*

---

(module 
  (main_module 
    (path_expr 
      (axis_step 
        (abbrev_foward) 
        (name_test (wildcard)))))) 


==================
3.3.5 Path: Abbreviated Syntax with reverse up
==================

..

---

(module 
  (main_module 
    (path_expr 
      (axis_step 
        (abbrev_reverse)))))


